jian-gege/51-mp3/c51-MP3/STC8A_NVIC.c
//========================================================================
// 函数: NVIC_BMM_M2M_Init
// 描述: BMM M2M嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_M2M_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_M2M_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_M2M_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_M2M_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_M2M_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_M2M_CFG &= ~0x80;		//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_SPI_Init
// 描述: BMM SPI嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-27
//========================================================================
u8 NVIC_BMM_SPI_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_SPI_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_SPI_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_SPI_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_SPI_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_SPI_CFG &= ~0x80;		//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART1_Tx_Init
// 描述: BMM UART1 Tx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART1_Tx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR1T_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR1T_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR1T_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR1T_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR1T_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART1_Rx_Init
// 描述: BMM UART1 Rx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART1_Rx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR1R_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR1R_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR1R_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR1R_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR1R_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART2_Tx_Init
// 描述: BMM UART2 Tx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART2_Tx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR2T_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR2T_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR2T_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR2T_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR2T_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART2_Rx_Init
// 描述: BMM UART2 Rx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART2_Rx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR2R_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR2R_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR2R_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR2R_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR2R_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART3_Tx_Init
// 描述: BMM UART3 Tx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART3_Tx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR3T_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR3T_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR3T_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR3T_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR3T_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

