jian-gege/51-mp3/c51-MP3/STC8A_NVIC.c
//========================================================================
// 函数: NVIC_BMM_UART3_Rx_Init
// 描述: BMM UART3 Rx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART3_Rx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR3R_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR3R_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR3R_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR3R_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR3R_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART4_Tx_Init
// 描述: BMM UART4 Tx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART4_Tx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR4T_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR4T_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR4T_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR4T_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR4T_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_UART4_Rx_Init
// 描述: BMM UART4 Rx嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_UART4_Rx_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_UR4R_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_UR4R_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_UR4R_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_UR4R_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_UR4R_CFG &= ~0x80;	//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_BMM_LCM_Init
// 描述: BMM LCM嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 参数: Bus_Priority: 数据总线访问优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_BMM_LCM_Init(u8 State, u8 Priority, u8 Bus_Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	BMM_LCM_CFG &= ~0x0f;
	if(Priority <= Priority_3) BMM_LCM_CFG |= Priority << 2;
	if(Bus_Priority <= Priority_3) BMM_LCM_CFG |= Bus_Priority;	//数据总线访问优先级
	if(State == ENABLE)
		BMM_LCM_CFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		BMM_LCM_CFG &= ~0x80;		//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

//========================================================================
// 函数: NVIC_LCM_Init
// 描述: LCM嵌套向量中断控制器初始化.
// 参数: State:    中断使能状态, ENABLE/DISABLE.
// 参数: Priority: 中断优先级, Priority_0,Priority_1,Priority_2,Priority_3.
// 返回: 执行结果 SUCCESS/FAIL.
// 版本: V1.0, 2021-05-21
//========================================================================
u8 NVIC_LCM_Init(u8 State, u8 Priority)
{
	EAXSFR();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
	LCMIFCFG &= ~0x30;
	if(Priority <= Priority_3) LCMIFCFG |= Priority << 4;
	if(State == ENABLE)
		LCMIFCFG |= 0x80;		//bit7 1:Enable Interrupt
	else
		LCMIFCFG &= ~0x80;		//bit7 0:Disable Interrupt
	EAXRAM();		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */
	return SUCCESS;
}

